/* Матущенко Наталья
2. Написать метод подсчета количества цифр числа.
*/
using System;

namespace Task2
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
